{
  "slug": "dasuki-trial-n33b-arms-fund",
  "title": "N33 Billion Meant for Weapons Bought Land and Funded Saudi Transfers Instead",
  "content": "<p>this is not a movie. this happened in court today.</p><p>michael adarikun, an efcc detective, stood in front of judge charles agbaza at the fct high court and started reading numbers. not small numbers. the kind that make your brain glitch for a second because surely you misheard.</p><p>N33.2 billion. with a B. billion naira that was supposed to buy weapons while boko haram was literally tearing through the northeast.</p><p>instead? land in abuja. properties. euros. dollars. transfers to saudi arabia.</p><p>i wish i was making this up.</p><h2>the account that went from N27,000 to hundreds of millions overnight</h2><p>adarikun is the first prosecution witness since they re-arraigned everyone in march 2025. he started testifying last year, came back tuesday, then wednesday.</p><p>he's been explaining how N2.2 billion moved from sambo dasuki's office (former national security adviser) into acacia holdings limited, a company owned by aminu baba-kusa, some former nnpc guy.</p><p>dasuki signed off on it. literally approved the transfer himself, along with the director of finance s.a. salisu. they have the transfer mandate with both signatures.</p><p>here's the funny part - and by funny i mean absolutely insane:</p><p>before the money hit, acacia holdings had N27,000 in their account. twenty-seven thousand naira. you probably have more than that right now.</p><p>then boom. hundreds of millions start flowing in. from \"broke student\" to \"billionaire\" overnight.</p><h2>the courtroom drama nobody talks about</h2><p>so the efcc lawyer, rotimi jacobs (a whole SAN), asked adarikun: \"from your investigations, how was this money spent?\"</p><p>immediately, all the defense lawyers jumped up objecting.</p><p>ebie richard, lawyer for baba-kusa and acacia holdings, started citing section 67 of the evidence act 2011. he argued that opinion evidence is inadmissible and adarikun wasn't an expert witness so he couldn't give opinions.</p><p>jacobs fired back saying his question wasn't asking for opinion - adarikun is the investigative police officer (ipo), which makes him an expert in this case.</p><p>judge agbaza listened to both sides and ruled: \"the question should be allowed.\"</p><p>then adarikun dropped the bomb.</p><h2>where the money actually went (a timeline of madness)</h2><p>the N2.2 billion came from the central bank. it was specifically for security during state house of assembly and gubernatorial elections.</p><p>it never touched election security.</p><p>instead, the money got split into chunks and sent to multiple accounts:</p><ul><li>N600 million to acacia holdings' uba account</li><li>N650 million to their ecobank account</li><li>N750 million to reliance referral hospital (also owned by baba-kusa)</li></ul><p>all three transfers came from the N2 billion sitting in the nsa's zenith bank account. money from cbn. for elections. that never saw elections.</p><p>then it gets specific. surgical, even.</p><p><strong>april 17, 2015:</strong> N650 million hits acacia holdings' ecobank account from the nsa's zenith account.</p><p><strong>april 20, 2015:</strong> transfer to baba-kusa himself. adarikun didn't say how much. just that it happened.</p><p><strong>april 22, 2015:</strong> N70 million to jubril abdullahi. N50 million to baba-kusa.</p><p><strong>april 23, 2015:</strong> N10 million moved between acacia holdings' own accounts. like they were just shuffling money around.</p><p><strong>may 25, 2015:</strong> N20 million to ec associates.</p><p><strong>june 1, 2015:</strong> N2 million to suraya maigida, a staff member. pocket change at this point.</p><p><strong>same day:</strong> N15 million to ibrahim saleh. this guy's whole job was buying properties for baba-kusa. this specific N15 million? complete payment for 'hospitality property nigeria' from zabati bdc limited.</p><p><strong>june 21, 2015:</strong> someone withdrew N250 million with the narration 'miscellaneous customer service.'</p><p>miscellaneous. customer. service.</p><p>brother, what kind of customer service costs N250 million?</p><p><strong>june 24, 2015:</strong> N2 million to saleh to 'facilitate the retention of a plot of land at wuse 2, abuja.'</p><p><strong>june 27, 2015:</strong> another N25 million to saleh. just because.</p><h2>properties, foreign currencies, and vanishing dollars</h2><p>adarikun testified that baba-kusa wasn't just buying land. he was buying foreign currencies - euros and dollars.</p><p>the saudi transfer is particularly wild.</p><p>N55.9 million moved to facilitate a $1 million foreign transfer to saudi arabia.</p><p>guess how much actually made it? $630,000.</p><p>the remaining $370,000? vanished. poof. gone.</p><p>nobody knows where. nobody's saying.</p><h2>the defense fights back (and loses this round)</h2><p>after all this testimony, the efcc tried to submit baba-kusa's statement from november-december 2015 as evidence.</p><p>all the defense lawyers objected immediately. they claimed it was involuntary - made while baba-kusa was in an efcc underground cell.</p><p>adarikun said no, the statement was prepared in a public area accessible to visitors and efcc staff. baba-kusa's lawyer, amin umahani, was right there.</p><p>ebie richard wasn't having it. he argued \"a statement cannot be voluntary while in the underground cell of the efcc,\" and cited section 15(4) and 17(2) of the administration of justice act 2015.</p><p>judge agbaza ordered a trial-within-a-trial to determine if the statement was voluntary. case continues february 24.</p><h2>this isn't even his only trial</h2><p>dasuki is also standing trial in another case for N4.6 billion arms procurement fraud.</p><p>this time he's alongside former sokoto governor attahiru bafarawa, bafarawa's son sagir, former minister of state for finance bashir yuguda, and some company called dalhatu investment limited.</p><p>same thing. money meant for fighting boko haram. allegedly diverted.</p><h2>some context because this is actually insane</h2><p>remember 2014-2015? boko haram was destroying the northeast. soldiers were literally begging for equipment on social media. dying because they didn't have proper weapons.</p><p>dasuki was the national security adviser from 2012 to 2015. under president goodluck jonathan. right in the middle of boko haram's worst period.</p><p>he was the guy in charge of buying weapons. he had the budget. N33.2 billion (and that's just what we know about in this one case).</p><p>when buhari won in 2015, he set up an audit panel. they found that approximately $2 billion for arms procurement was just... gone. unaccounted for.</p><p>this trial started in 2015. it's 2026 now. eleven years.</p><p>we're still in court listening to testimony about bank transfers from over a decade ago.</p><p>early on, the sss literally refused to release dasuki on bail even though courts kept ordering them to. they just... didn't. that's why the trial suffered so many adjournments in the early years.</p><h2>the part that keeps me up at night</h2><p>all of this was said under oath. in open court. sworn testimony.</p><p>while boko haram was massacring people in the northeast, while nigerian soldiers were dying with outdated weapons and no ammunition, someone allegedly took N33.2 billion meant for arms and used it to:</p><ul><li>buy land in abuja</li><li>purchase properties through shell companies</li><li>acquire foreign currencies in euros and dollars</li><li>send money to saudi arabia (with $370,000 vanishing mid-transfer)</li><li>pay for 'miscellaneous customer service' worth N250 million</li></ul><p>N33.2 billion could've changed everything. equipped an entire army. maybe saved thousands of lives. turned the tide against boko haram earlier.</p><p>instead, if these allegations are true, it bought land and facilitated dollar transfers.</p><p>dasuki and everyone else deny everything. all 32 counts.</p><p>the trial continues. eleven years later, we're still counting.</p><hr><p><strong>reference:</strong> <a href=\"https://www.instagram.com/p/DTdWpTAjI6o/\" target=\"_blank\">instagram.com/p/DTdWpTAjI6o</a></p>",
  "excerpt": "an efcc investigator testified in court about how n33 billion meant for weapons ended up funding land purchases, properties, and foreign transfers",
  "date": "2026-01-14"
}
