{
  "slug": "dasuki-trial-n33b-arms-fund",
  "title": "N33 Billion Meant for Weapons Bought Land and Funded Saudi Transfers Instead",
  "content": "<p>this is not a movie. this happened in court today.</p><p>an efcc investigator stood in front of a judge and started reading numbers. not small numbers. the kind that make your brain glitch for a second because surely you misheard.</p><p>N33 billion. with a B. billion naira that was supposed to buy weapons while boko haram was literally tearing through the northeast.</p><p>instead? land in abuja. properties. dollar transfers to saudi arabia.</p><p>i wish i was making this up.</p><h2>the account that went from broke to balling overnight</h2><p>so michael adarikun, this efcc detective, testified about how N2.2 billion moved from sambo dasuki's office (he was the national security adviser) into a private company called acacia holdings limited.</p><p>the company belonged to aminu baba-kusa, some former nnpc guy.</p><p>here's the funny part - and by funny i mean absolutely insane:</p><p>before the money hit, acacia holdings had N27,000 in their account. twenty-seven thousand naira. you probably have more than that in your savings right now.</p><p>then boom. hundreds of millions start flowing in. from \"broke student\" to \"billionaire\" overnight.</p><h2>where did all the money go?</h2><p>the investigator literally sat there reading out transfers like he was reading a shopping list:</p><ul><li>N600 million here</li><li>N650 million there</li><li>N750 million to some hospital</li></ul><p>then it got weirdly specific. like they weren't even trying to hide it anymore.</p><p>N70 million to some guy named jubril abdullahi. N50 million straight to baba-kusa himself. N20 million here. N2 million there to a staff member (suraya maigida, in case you're wondering).</p><p>N15 million went to ibrahim saleh - apparently the designated property buyer. that specific payment? for something called 'hospitality property nigeria.'</p><p>then someone withdrew N250 million with the label 'miscellaneous customer service.' miscellaneous. customer. service.</p><p>brother, what kind of customer service costs N250 million?</p><p>another N2 million to 'facilitate the retention of a plot of land at wuse 2.' then N25 million more a few days later because why not.</p><h2>the islamic academy that wasn't about education</h2><p>N60 million allegedly went to an islamic academy. sounds noble right?</p><p>wrong.</p><p>it was for land. 3.62 hectares in kyami district opposite centenary city along airport road. not a single naira for education.</p><p>survey fees. beacon processing. stadium layouts. all funded with money meant to buy weapons.</p><p>let that sink in.</p><h2>the saudi transfer that lost $370,000 somewhere</h2><p>this one is wild even by nigerian standards.</p><p>N55.9 million moved to facilitate a $1 million foreign transfer to saudi arabia.</p><p>guess how much actually made it to saudi? $630,000.</p><p>the remaining $370,000? vanished. poof. gone.</p><p>nobody knows where. nobody's saying.</p><h2>some context because this is actually insane</h2><p>remember 2014-2015? boko haram was destroying the northeast. soldiers were literally begging for equipment on social media. dying because they didn't have proper weapons.</p><p>dasuki was the guy in charge of buying those weapons. he had the budget. N33 billion (and that's just what we know about).</p><p>buhari's audit panel later found that $2 billion for arms was just... gone. unaccounted for.</p><p>this trial started in 2015. it's 2026 now. eleven years. we're still in court listening to testimony about bank transfers from over a decade ago.</p><p>early on, the sss literally refused to release dasuki on bail even though courts kept ordering them to. they just... didn't.</p><h2>the defense is fighting back</h2><p>when the efcc tried to submit baba-kusa's statement as evidence, his lawyers objected hard.</p><p>they claimed it was made under duress in an efcc underground cell. the prosecution said no, it was in a public area with his lawyer present.</p><p>so now the judge ordered a trial-within-a-trial just to figure out if the statement counts. the case continues february 24.</p><h2>the part that keeps me up at night</h2><p>all of this was said under oath. in open court. sworn testimony.</p><p>while boko haram was massacring people, while soldiers were dying with outdated weapons, someone allegedly used N33 billion to buy land in abuja and send money to saudi arabia.</p><p>N33 billion could've changed everything. equipped an entire army. maybe saved thousands of lives.</p><p>instead, if these allegations are true, it bought properties and facilitated dollar transfers.</p><p>the trial continues. eleven years later, we're still counting.</p>",
  "excerpt": "an efcc investigator testified in court about how n33 billion meant for weapons ended up funding land purchases, properties, and foreign transfers",
  "date": "2026-01-14"
}
